In [ ]:
# find the different rows between two dataframes
# source: https://kanoki.org/2019/07/04/pandas-difference-between-two-dataframes/

In [7]:
import pandas as pd
 
df1 = pd.DataFrame({'City': ['New York', 'Chicago', 'Tokyo', 'Paris','New Delhi'],
                     'Temp': [59, 29, 73, 56,48]})
 
df2 = pd.DataFrame({'City': ['London', 'New York', 'Tokyo', 'New Delhi','Paris'],
                     'Temp': [55, 55, 73, 85,56],
                     'day':[1, 2, 3, 4, 5]})

In [8]:
df1

        City  Temp
0   New York    59
1    Chicago    29
2      Tokyo    73
3      Paris    56
4  New Delhi    48

In [9]:
df2

        City  Temp  day
0     London    55    1
1   New York    55    2
2      Tokyo    73    3
3  New Delhi    85    4
4      Paris    56    5

In [10]:
# find the common row. Likewise, you can find "left_only" or "right_only"
df = df1.merge(df2, how = 'outer' ,indicator=True).loc[lambda x : x['_merge']=='both']

df

    City  Temp  day _merge
2  Tokyo    73  3.0   both
3  Paris    56  5.0   both

In [11]:
df1.merge(df2, how = 'outer' ,indicator=True)

        City  Temp  day      _merge
0   New York    59  NaN   left_only
1    Chicago    29  NaN   left_only
2      Tokyo    73  3.0        both
3      Paris    56  5.0        both
4  New Delhi    48  NaN   left_only
5     London    55  1.0  right_only
6   New York    55  2.0  right_only
7  New Delhi    85  4.0  right_only